app/Http/Controllers/LandingPageController.php

select * from `category_contents` where `category_contents`.`section_id` in (2, 3, 4, 5, 6, 7, 8, 9, 11)
select * from `pages` limit 1
select * from `themes` where `themes`.`id` in (14, 15, 16, 17, 18, 19, 20, 21, 24)
select * from `news` order by `created_at` desc limit 2
select `tags`.*, `tag_new`.`new_id` as `pivot_new_id`, `tag_new`.`tag_id` as `pivot_tag_id` from `tags` inner join `tag_new` on `tags`.`id` = `tag_new`.`tag_id` where `tag_new`.`new_id` in (8, 9)
select * from `courses`
select * from `persons` where `type` = 'student' limit 6
select * from `category_coureses`
---
    public function index()
    {
        $page = Page::with(['sections.contents.images', 'sections.category_contents.contents.images', 'sections.theme', 'sections' => function ($q) {
            $q->where('active', 1);
        }])->first();
        // $pages = Page::orderBy('id_priority', 'asc')->orderBy('id', 'asc')->get();
        $last_new  = News::with('languages', 'category', 'tags')->orderBy('created_at', 'desc')->take(2)->get();
        $courses = Course::take(4)->get();
        $teachers = Persons::where('type','teacher')->take(6)->get();
        $students = Persons::where('type','student')->take(3)->get();
        $category_courses = CategoryCourese::all();